RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/MKM34Z7.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SIM</name>
      <description>System Integration Module</description>
      <prependToName>SIM_</prependToName>
      <baseAddress>0x4003E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10D0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SOPT1</name>
          <description>System Options Register 1</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x6000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAMSIZE</name>
              <description>Returns the size of the system RAM</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0110</name>
                  <description>32 KB System RAM</description>
                  <value>#0110</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSC32KSEL</name>
              <description>32K oscillator clock select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>OSC32KCLK (RTC Oscillator output)</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>ERCLK32K</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>MCGIRCLK</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>LPO</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SOPT1_CFG</name>
          <description>SOPT1 Configuration Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPTMR0SEL</name>
              <description>LP Timer Channel0 Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>CMP[0] output</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>CMP[1] output</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>CMP[2] output</description>
                  <value>#10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPTMR1SEL</name>
              <description>LP Timer Channel1 Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Pad PTE4</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Pad PTF4</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Pad PTG1</description>
                  <value>#10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPTMR2SEL</name>
              <description>LP Timer Channel2 Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Pad PTD6</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Pad PTF3</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Pad PTG5</description>
                  <value>#10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPTMR3SEL</name>
              <description>LP Timer Channel3 Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Pad PTD5</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Pad PTG0</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Pad PTG6</description>
                  <value>#10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAMSBDIS</name>
              <description>no description available</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Source bias of System SRAM enabled during VLPR and VLPW modes.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Source bias of System SRAM disabled during VLPR and VLPW modes.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAMBPEN</name>
              <description>RAM Bitline Precharge Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Bitline precharge of system SRAM disabled during VLPR and VLPW modes.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Bitline precharge of system SRAM enabled during VLPR and VLPW modes.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
